zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
#define USE_LOVYANGFX
/**
 * @file      tas.ino
 * @author    Lewis He (lewishe@outlook.com)
 * @license   MIT
 * @copyright Copyright (c) 2023  Shenzhen Xin Yuan Electronic Technology Co.,
 * Ltd
 * @date      2024-02-03
 * @note      Converted from ESP-IDF tas example
 *            This example bridges Ethernet to WiFi AP using NAPT
 */

#include <Arduino.h>
#include <ETHClass2.h> //Is to use the modified ETHClass
#define ETH ETH2
#include "utilities.h" //Board PinMap
#include <WiFi.h>
//#include <ESP32Ping.h>
#include <ETH.h>
#include "lwip/lwip_napt.h"
#include <WiFi.h>
#include "driver/gpio.h"
#include "soc/gpio_struct.h"
#include "soc/io_mux_reg.h"
#include "driver/spi_master.h"
#include "esp_task_wdt.h"

// Diagnostic function to dump GPIO Matrix configuration
void gpio_dump_io_configuration(int gpio_num, const char* name) {
    if (gpio_num < 0 || gpio_num >= GPIO_NUM_MAX) return;
    
    // Get Output Signal Index from GPIO Matrix
    uint32_t out_idx = REG_GET_FIELD(GPIO_FUNC0_OUT_SEL_CFG_REG + (gpio_num * 4), GPIO_FUNC0_OUT_SEL);
    
    // Get Input/Output enable status
    bool out_en = false;
    if (gpio_num < 32) out_en = (GPIO.enable >> gpio_num) & 1;
    else out_en = (GPIO.enable1.data >> (gpio_num - 32)) & 1;
    
    Serial.printf("  [GPIO %d] %-8s | Output Signal Index: %d (0x%03X) | OutEn: %d\n", 
                  gpio_num, name, (int)out_idx, (int)out_idx, (int)out_en);
}
#include <SPI.h>
#include <esp_wifi.h> // For esp_wifi_set_bandwidth
#include <esp_system.h> // For esp_reset_reason
#include <rom/rtc.h>    // For rtc_get_reset_reason

static SPIClass* spi_p = nullptr;

#ifdef USE_LOVYANGFX
#include "LGFX_Config.hpp"
#else
#include <TFT_eSPI.h> // LCD Library
#endif
#include <lvgl.h>    // LVGL Graphic Library
#ifdef ENABLE_TOUCH
#ifdef LCD_TYPE_ILI9341
#include <XPT2046_Touchscreen.h> // XPT2046 Touch Library
#else
//#include <TAMC_GT911.h> // GT911 Touch Library (Default for ST7789)
#endif
#endif

// --- Build Config Logging Macros ---
#define STR_HELPER(x) #x
#define STR(x) STR_HELPER(x)

#pragma message("--- [BUILD INFO] ---------------------------------------")
#ifdef LILYGO_T_ETH_LITE_ESP32S3
  #pragma message("--- [BOARD] LilyGO T-ETH-Lite ESP32-S3")
#elif defined(ESP32_S3_LCD_EV_BOARD_2)
  #pragma message("--- [BOARD] ESP32-S3-LCD-EV-BOARD-2")
#elif defined(TAS_CUSTOM_BOARD)
  #pragma message("--- [BOARD] TAS Custom Board")
#else
  #pragma message("--- [BOARD] Unknown ESP32-S3 Board")
#endif

#ifdef LCD_TYPE_ST7789
  #pragma message("--- [LCD  ] Type: ST7789 (240x320)")
#elif defined(LCD_TYPE_ILI9341)
  #ifdef TFT_PARALLEL_16_BIT
    #pragma message("--- [LCD  ] Type: ILI9341 (240x320) [16-bit Parallel]")
  #else
    #pragma message("--- [LCD  ] Type: ILI9341 (240x320) [SPI]")
  #endif
#elif defined(LCD_TYPE_ST7796)
  #pragma message("--- [LCD  ] Type: ST7796 (320x480)")
#else
  #pragma message("--- [LCD  ] Type: Unknown/Not Defined")
#endif

#if defined(TFT_RST)
  #pragma message("--- [LCD  ] TFT_RST Pin: " STR(TFT_RST))
#endif

#ifdef SPI_FREQUENCY
  #if SPI_FREQUENCY == 80000000
    #pragma message("--- [SPI  ] Frequency: 80 MHz")
  #elif SPI_FREQUENCY == 40000000
    #pragma message("--- [SPI  ] Frequency: 40 MHz")
  #elif SPI_FREQUENCY == 27000000
    #pragma message("--- [SPI  ] Frequency: 27 MHz")
  #elif SPI_FREQUENCY == 20000000
    #pragma message("--- [SPI  ] Frequency: 20 MHz")
  #else
    #pragma message("--- [SPI  ] Frequency: " STR(SPI_FREQUENCY) " Hz")
  #endif
#else
  #pragma message("--- [SPI  ] Frequency: Not Defined (Using Default)")
#endif

#ifdef LV_DISP_DEF_REFR_PERIOD
  #if LV_DISP_DEF_REFR_PERIOD == 16
    #pragma message("--- [LVGL ] Refresh: 16 ms (62 FPS target)")
  #elif LV_DISP_DEF_REFR_PERIOD == 33
    #pragma message("--- [LVGL ] Refresh: 33 ms (30 FPS target)")
  #else
    #pragma message("--- [LVGL ] Refresh: " STR(LV_DISP_DEF_REFR_PERIOD) " ms (" STR(1000/LV_DISP_DEF_REFR_PERIOD) " FPS target)")
  #endif
#else
  #pragma message("--- [LVGL ] Refresh: Not Defined (Using LVGL Default)")
#endif

#ifdef ENABLE_TOUCH
  #pragma message("--- [TOUCH] Status: ENABLED")
#else
  #pragma message("--- [TOUCH] Status: DISABLED")
#endif
#pragma message("--------------------------------------------------------")
// -----------------------------------
#include <stdarg.h>  // For va_list
#include <Preferences.h> // For NVS storage
#include <esp_mac.h>     // For esp_read_mac
#include <esp_netif_net_stack.h>
#include <lwip/netif.h>
#include <lwip/prot/ip.h>
#include <lwip/prot/ip4.h>
#include <lwip/prot/udp.h>
#include <lwip/prot/tcp.h>
#include <lwip/apps/lwiperf.h>
#include <AsyncUDP.h>
#include <inttypes.h>
#include "toe_iperf.h"
#include "socket_bridge.h"
#include "w5500_base.h"
#ifdef ENABLE_AUDIO
#include "audio_output.h"
#endif
#include "soc/gpio_struct.h"
#include "driver/gpio.h"
#include "soc/io_mux_reg.h"
#include "cpu_stats.h"
#include "file_manager.h"
#include "usb_msc.h"
#include "audio_player.h"


// Global Traffic Stats
struct InterfaceStats {
    uint64_t rx_bytes = 0;
    uint64_t tx_bytes = 0;
    uint32_t rx_packets = 0;
    uint32_t tx_packets = 0;
};

// Log System Configuration
enum LogLevel { LOG_NONE = 0, LOG_ERROR, LOG_WARN, LOG_INFO, LOG_DEBUG };
static LogLevel current_log_level = LOG_INFO;

// Dmesg Ring Buffer
#define DMESG_MAX_LINES 50
#define DMESG_MAX_LEN 128

struct DmesgEntry {
    unsigned long timestamp;
    LogLevel level;
    char message[DMESG_MAX_LEN];
};

static DmesgEntry dmesg_buffer[DMESG_MAX_LINES];
static int dmesg_head = 0;
static int dmesg_tail = 0;
static int dmesg_count = 0;

#include <dirent.h>
#include <sys/stat.h>

void list_files(const char *path) {
    DIR *dir = opendir(path);
    if (!dir) {
        Serial.printf("[ERROR] Failed to open directory: %s\n", path);
        return;
    }

    Serial.printf("\n--- File List: %s ---\n", path);
    struct dirent *ent;
    while ((ent = readdir(dir)) != NULL) {
        struct stat st;
        char full_path[256];
        snprintf(full_path, sizeof(full_path), "%s/%s", path, ent->d_name);
        stat(full_path, &st);
        
