zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
        if (ent->d_type == DT_DIR) {
            Serial.printf("[DIR ] %-20s\n", ent->d_name);
        } else {
            Serial.printf("[FILE] %-20s  (%ld bytes)\n", ent->d_name, (long)st.st_size);
        }
    }
    Serial.println("----------------------------\n");
    closedir(dir);
}

void addDmesg(LogLevel level, const char* msg) {
    dmesg_buffer[dmesg_head].timestamp = millis();
    dmesg_buffer[dmesg_head].level = level;
    strncpy(dmesg_buffer[dmesg_head].message, msg, DMESG_MAX_LEN - 1);
    dmesg_buffer[dmesg_head].message[DMESG_MAX_LEN - 1] = '\0';
    
    dmesg_head = (dmesg_head + 1) % DMESG_MAX_LINES;
    if (dmesg_count < DMESG_MAX_LINES) {
        dmesg_count++;
    } else {
        dmesg_tail = (dmesg_tail + 1) % DMESG_MAX_LINES;
    }
}

void logMsg(LogLevel level, const char* format, ...) {
  char buf[256];
  va_list args;
  va_start(args, format);
  vsnprintf(buf, sizeof(buf), format, args);
  va_end(args);
  
  // Always add to dmesg buffer
  addDmesg(level, buf);

  if (level <= current_log_level) {
    switch(level) {
      case LOG_ERROR: Serial.print("[ERROR] "); break;
      case LOG_WARN:  Serial.print("[WARN ] "); break;
      case LOG_INFO:  Serial.print("[INFO ] "); break;
      case LOG_DEBUG: Serial.print("[DEBUG] "); break;
      default: break;
    }
    Serial.print(buf);
    Serial.print("\r\n");
  }
}

// Interface instances


InterfaceStats eth_stats;
InterfaceStats ap_stats;
bool traffic_log_enabled = false;

// Hook Function types
typedef err_t (*netif_input_fn)(struct pbuf *p, struct netif *inp);
typedef err_t (*netif_linkoutput_fn)(struct netif *netif, struct pbuf *p);

netif_input_fn orig_eth_input = NULL;
netif_linkoutput_fn orig_eth_linkoutput = NULL;
netif_input_fn orig_ap_input = NULL;
netif_linkoutput_fn orig_ap_linkoutput = NULL;

void logPacket(const char* iface, bool rx, struct pbuf* p) {
    if (!traffic_log_enabled) return;
    
    uint8_t *payload = (uint8_t *)p->payload;
    struct ip_hdr *iphdr = NULL;

    // Detection logic:
    // 1. Direct IPv4 (ihl and version)
    if (p->len >= 20 && (payload[0] & 0xF0) == 0x40) {
        iphdr = (struct ip_hdr *)payload;
    }
    // 2. Ethernet Encapsulated IPv4 (EtherType 0x0800 at offset 12)
    else if (p->len >= 34 && payload[12] == 0x08 && payload[13] == 0x00 && (payload[14] & 0xF0) == 0x40) {
        iphdr = (struct ip_hdr *)(payload + 14);
    }

    if (iphdr) {
        char src_ip[16], dst_ip[16];
        ip4addr_ntoa_r((const ip4_addr_t*)&(iphdr->src), src_ip, sizeof(src_ip));
        ip4addr_ntoa_r((const ip4_addr_t*)&(iphdr->dest), dst_ip, sizeof(dst_ip));
        
        const char* proto = "OTHER";
        uint8_t p_type = IPH_PROTO(iphdr);
        if (p_type == IP_PROTO_ICMP) proto = "ICMP";
        else if (p_type == IP_PROTO_TCP) proto = "TCP";
        else if (p_type == IP_PROTO_UDP) proto = "UDP";
        
        Serial.printf("[%s %s] %s -> %s (%s, %d bytes)\r\n", 
                      iface, rx ? "RX" : "TX", src_ip, dst_ip, proto, p->tot_len);
    }
}

// Helper to print 64-bit values accurately
String formatBytes(uint64_t bytes) {
    if (bytes < 1024) return String((unsigned long)bytes) + " B";
    else if (bytes < 1024 * 1024) return String((unsigned long)(bytes / 1024)) + " KB";
    else return String((unsigned long)(bytes / (1024 * 1024))) + " MB";
}

err_t eth_input_hook(struct pbuf *p, struct netif *inp) {
    eth_stats.rx_bytes += p->tot_len;
    eth_stats.rx_packets++;
    logPacket("ETH", true, p);
    return orig_eth_input(p, inp);
}

err_t eth_linkoutput_hook(struct netif *netif, struct pbuf *p) {
    eth_stats.tx_bytes += p->tot_len;
    eth_stats.tx_packets++;
    logPacket("ETH", false, p);
    return orig_eth_linkoutput(netif, p);
}

err_t ap_input_hook(struct pbuf *p, struct netif *inp) {
    ap_stats.rx_bytes += p->tot_len;
    ap_stats.rx_packets++;
    logPacket("AP ", true, p);
    return orig_ap_input(p, inp);
}

err_t ap_linkoutput_hook(struct netif *netif, struct pbuf *p) {
    ap_stats.tx_bytes += p->tot_len;
    ap_stats.tx_packets++;
    logPacket("AP ", false, p);
    return orig_ap_linkoutput(netif, p);
}


// WiFi AP Configuration - Base values
#define AP_SSID_BASE "tas"
#define AP_PASSWORD_BASE "12345678"
#define AP_CHANNEL 1
#define AP_MAX_CONN 4

// Log System moved up

// Shell Configuration
static String inputString = "";
static bool stringComplete = false;
static String ap_ssid_custom = AP_SSID_BASE;
static String ap_pw_custom = AP_PASSWORD_BASE;

Preferences preferences;

// Traffic Monitoring State
static uint32_t last_eth_rx = 0;
static uint32_t last_eth_tx = 0;
static uint32_t last_ap_rx = 0;
static uint32_t last_ap_tx = 0;
static unsigned long last_speed_check = 0;
// Shell & Monitoring Configuration
static bool monitor_traffic = false;
static bool monitor_enabled = false;
static int cursor_pos = 0;

// iPerf State
static void* lwiperf_session = NULL;
static void lwiperf_report(void* arg, enum lwiperf_report_type report_type,
                           const ip_addr_t* local_addr, u16_t local_port, const ip_addr_t* remote_addr, u16_t remote_port,
                           u32_t bytes_transferred, u32_t ms_duration, u32_t bandwidth_kbitpsec) {
    
    float mbps = bandwidth_kbitpsec / 1000.0;
    float mb_s = mbps / 8.0;
    float total_mb = bytes_transferred / (1024.0 * 1024.0);

    Serial.printf("\r\n--- iPerf TCP Report ---\n");
    Serial.printf("Type: %d\n", (int)report_type);
    Serial.printf("Duration: %lu ms\n", ms_duration);
    Serial.printf("Transferred: %lu Bytes (%.2f MB)\n", bytes_transferred, total_mb);
    Serial.printf("Bandwidth: %.2f Mbps (%.2f MB/s)\n", mbps, mb_s);
    Serial.printf("------------------------\n> ");
    // Unset the session if it's done or aborted
    if (report_type == LWIPERF_TCP_DONE_SERVER || report_type == LWIPERF_TCP_ABORTED_LOCAL || 
        report_type == LWIPERF_TCP_ABORTED_LOCAL_DATAERROR || report_type == LWIPERF_TCP_ABORTED_LOCAL_TXERROR || 
        report_type == LWIPERF_TCP_ABORTED_REMOTE) {
         lwiperf_session = NULL;
    }
}

// UDP iPerf State
static AsyncUDP udp_iperf_server;
static bool udp_iperf_running = false;
static volatile uint32_t udp_iperf_bytes = 0;
static uint32_t udp_iperf_last_print = 0;

static void onUDPPacket(AsyncUDPPacket packet) {
  udp_iperf_bytes += packet.length();
}

// Ping State
static bool ping_running = false;
static String ping_target = "";
static unsigned long last_ping_time = 0;

// Top Monitoring State
static bool top_running = false;
static unsigned long last_top_time = 0;
CPUStats cpuStats;


