zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
// Global State
volatile uint32_t last_flush_time_us = 0;
volatile uint32_t last_pure_render_time_us = 0;
volatile uint32_t last_render_time_ms = 0;
static uint64_t refresh_trigger_us = 0;
static uint64_t last_flush_end_us = 0;
static uint32_t accumulated_render_us = 0;
static volatile uint32_t frame_cnt = 0;
static uint32_t fps_val = 0;

#if defined(ENABLE_GRADIENT_BG) || defined(ENABLE_TEST_BALL)
/* Timer callback for Full Screen UI changes (Gradient/Color shift logic) */
void move_test_rect_cb(lv_timer_t * t) {
#ifdef ENABLE_GRADIENT_BG
  static uint8_t c = 0;
  c += 2;
  lv_obj_t *scr = lv_scr_act();
  if (scr) {
    lv_obj_set_style_bg_color(scr, lv_color_make(c, 100, 200), 0);
    lv_obj_set_style_bg_grad_color(scr, lv_color_make(200 - c, 50, 150), 0);
    lv_obj_set_style_bg_grad_dir(scr, LV_GRAD_DIR_VER, 0);
  }
#endif

#ifdef ENABLE_TEST_BALL
  if (ui_test_rect) {
      // 화면 크기: landscape 320x240 고정
      static const int BALL_SIZE = 25;
      static const int SCR_W = 320;
      static const int SCR_H = 240;
      static float x_pos = (SCR_W - BALL_SIZE) / 2.0f;
      static float y_pos = (SCR_H - BALL_SIZE) / 2.0f;
      static int x_dir = 1, y_dir = 1; // 방향 부호만 관리

#ifdef ENABLE_DELTATIME_ANIM
      // 시간 기반 이동 (Delta-Time)
      static uint32_t last_move_ms = 0;
      uint32_t now_ms = (uint32_t)(esp_timer_get_time() / 1000);
      
      // 첫 호출 시 초기화
      if (last_move_ms == 0) last_move_ms = now_ms;
      
      uint32_t dt_ms = now_ms - last_move_ms;
      last_move_ms = now_ms;

      // 비정상적으로 긴 dt 방어 (예: 100ms 초과 시 16ms로 간주)
      if (dt_ms > 100) dt_ms = 16;

      // 목표 속도: 프레임당 2px 이동 기준 (현재 설정된 Target FPS에 비례)
      // 예: 60 FPS -> 120 px/sec, 30 FPS -> 60 px/sec
      static const float TARGET_FPS = 1000.0f / LV_DISP_DEF_REFR_PERIOD;
      static const float SPEED_PX_PER_SEC = 2.0f * TARGET_FPS;
      float move_step = (SPEED_PX_PER_SEC * dt_ms) / 1000.0f;

      // 경계 충돌 검사 및 위치 보정 (벽 끼임 방지)
      if (x_pos <= 0) {
          x_pos = 0;
          x_dir = 1;
      } else if (x_pos >= (float)(SCR_W - BALL_SIZE)) {
          x_pos = (float)(SCR_W - BALL_SIZE);
          x_dir = -1;
      }

      if (y_pos <= 0) {
          y_pos = 0;
          y_dir = 1;
      } else if (y_pos >= (float)(SCR_H - BALL_SIZE)) {
          y_pos = (float)(SCR_H - BALL_SIZE);
          y_dir = -1;
      }

      x_pos += move_step * (float)x_dir;
      y_pos += move_step * (float)y_dir;
#else
      // 기존 방식: 프레임당 고정 2px 이동 (보정 포함)
      static const int MOVE_STEP = 2;
      if (x_pos <= 0) {
          x_pos = 0;
          x_dir = 1;
      } else if (x_pos >= (float)(SCR_W - BALL_SIZE)) {
          x_pos = (float)(SCR_W - BALL_SIZE);
          x_dir = -1;
      }

      if (y_pos <= 0) {
          y_pos = 0;
          y_dir = 1;
      } else if (y_pos >= (float)(SCR_H - BALL_SIZE)) {
          y_pos = (float)(SCR_H - BALL_SIZE);
          y_dir = -1;
      }
      x_pos += (float)MOVE_STEP * (float)x_dir;
      y_pos += (float)MOVE_STEP * (float)y_dir;
#endif
      lv_obj_set_pos(ui_test_rect, (int)x_pos, (int)y_pos);
  }
#endif
}
#endif

#ifdef ENABLE_TE_SYNC
#define TE_PIN 21
static SemaphoreHandle_t te_semaphore = NULL;

// TE 핀 주파수 측정용 변수 (명령어 사이사이 안전한 읽기를 위해 64비트 타이머 사용)
volatile int64_t last_te_time_us = 0;
volatile int64_t te_delta_us = 0;

void IRAM_ATTR te_isr_handler() {
    int64_t now_us = esp_timer_get_time();
    if (last_te_time_us > 0) {
        te_delta_us = now_us - last_te_time_us;
    }
    last_te_time_us = now_us;

    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if (te_semaphore != NULL) {
        xSemaphoreGiveFromISR(te_semaphore, &xHigherPriorityTaskWoken);
        if (xHigherPriorityTaskWoken) {
            portYIELD_FROM_ISR();
        }
    }
}
#endif

/* Display flushing callback (Asynchronous DMA) */
#ifdef USE_LOVYANGFX
void my_disp_flush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *color_p) {
  if (tft == nullptr) return;

  uint32_t w = (area->x2 - area->x1 + 1);
  uint32_t h = (area->y2 - area->y1 + 1);
  static bool transfer_open = false;

  // 프레임 시작 시간 측정 (첫 번째 조각인 경우)
  uint64_t now_us = esp_timer_get_time();
  static uint64_t frame_start_us = 0;
  static bool is_first_chunk = true; 
  if (is_first_chunk) {
      frame_start_us = now_us;
      is_first_chunk = false;
      // 첫 조각의 렌더링 시간 = 루프 시작(lv_timer_handler 직전)부터 첫 flush 호출까지
      accumulated_render_us = (uint32_t)(now_us - refresh_trigger_us);
  } else {
      // 후속 조각의 렌더링 시간 = 이전 조각 전송 완료부터 현재 flush 호출까지
      accumulated_render_us += (uint32_t)(now_us - last_flush_end_us);
  }

  // 1. Wait for PREVIOUS DMA transfer to finish (Safety)
  if (transfer_open) {
    tft->waitDMA();
    tft->endWrite();
  }

  // 2. Start new transfer session
  tft->startWrite();
  
#ifdef ENABLE_TE_SYNC
  // 3. V-Sync(TE) Sync
  static bool wait_for_te = true;
  if (wait_for_te && te_semaphore != NULL) {
      xSemaphoreTake(te_semaphore, pdMS_TO_TICKS(100));
  }
  wait_for_te = lv_disp_flush_is_last(disp);
#endif

  // 4. Start non-blocking DMA transfer
  tft->pushImageDMA(area->x1, area->y1, w, h, (uint16_t *)&color_p->full);
  transfer_open = true;

  // 프레임 완료 처리 (마지막 조각인 경우)
  if (lv_disp_flush_is_last(disp)) {
      tft->waitDMA(); // 하드웨어 전송이 완전히 끝날 때까지 대기하여 정확한 Flush 시간 측정
      uint64_t frame_end_us = esp_timer_get_time();
      last_flush_time_us = (uint32_t)(frame_end_us - frame_start_us);
      last_pure_render_time_us = accumulated_render_us;
      is_first_chunk = true; // 다음 프레임을 위해 플래그 리셋
      frame_cnt++;
  }
  
  last_flush_end_us = esp_timer_get_time();
  lv_disp_flush_ready(disp);
}
#else
void my_disp_flush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *color_p) {
  if (tft == nullptr) return;

  uint32_t w = (area->x2 - area->x1 + 1);
  uint32_t h = (area->y2 - area->y1 + 1);
  static bool transfer_open = false;

  // 1. Wait for PREVIOUS DMA transfer to finish, then close the SPI transaction
  if (transfer_open) {
    if (tft->dmaBusy()) {
      //delay(1); or yield();
      yield();
      tft->dmaWait();
    }
    tft->endWrite(); // Resets CS pin HIGH (SPI Sync reset)
  }

  // 2. Start new transfer session (CS pin LOW)
  tft->startWrite(); 
  tft->setAddrWindow(area->x1, area->y1, w, h);

#ifdef ENABLE_TE_SYNC
  // 3. V-Sync(TE) 동기화 복구 (첫 번째 조각 전송 전에만 스캐너 대기)
  static bool wait_for_te = true;
  if (wait_for_te && te_semaphore != NULL) {
      xSemaphoreTake(te_semaphore, pdMS_TO_TICKS(100)); // TE 신호 한 사이클 대기
  }
  wait_for_te = lv_disp_flush_is_last(disp); // 마지막 조각을 보낼 때 다음 프레임을 위해 대기 락 설정
#endif

  tft->pushPixelsDMA((uint16_t *)color_p, w * h);
  
  // CRITICAL: We DO NOT call tft.endWrite() here!
  // Instead, we mark it open so the NEXT flush closes it to prevent SPI lock-up.
  transfer_open = true;
  
  frame_cnt++;
  lv_disp_flush_ready(disp); // Tell LVGL we are ready for the NEXT frame buffer
}
#endif

