zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
  // --- Ethernet Panel ---
  lv_obj_t *eth_panel = lv_obj_create(panel_container);
  lv_obj_set_size(eth_panel, 140, 140);
  lv_obj_set_style_bg_color(eth_panel, lv_color_make(35, 40, 50), 0);
  lv_obj_set_style_border_color(eth_panel, lv_color_make(80, 80, 90), 0);
  lv_obj_set_style_border_width(eth_panel, 1, 0);
  lv_obj_set_layout(eth_panel, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(eth_panel, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_flex_align(eth_panel, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

  lv_obj_t *eth_title = lv_label_create(eth_panel);
  lv_label_set_text(eth_title, "Ethernet");
  lv_obj_set_style_text_color(eth_title, lv_palette_main(LV_PALETTE_CYAN), 0);
  lv_obj_set_style_text_font(eth_title, &lv_font_montserrat_14, 0);

  ui_label_eth = lv_label_create(eth_panel);
  lv_label_set_recolor(ui_label_eth, true);
  lv_label_set_text(ui_label_eth, "#FF0000 Offline#");
  lv_obj_set_style_text_align(ui_label_eth, LV_TEXT_ALIGN_CENTER, 0);

  // --- AP Panel ---
  lv_obj_t *ap_panel = lv_obj_create(panel_container);
  lv_obj_set_size(ap_panel, 140, 140);
  lv_obj_set_style_bg_color(ap_panel, lv_color_make(35, 40, 50), 0);
  lv_obj_set_style_border_color(ap_panel, lv_color_make(80, 80, 90), 0);
  lv_obj_set_style_border_width(ap_panel, 1, 0);
  lv_obj_set_layout(ap_panel, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(ap_panel, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_flex_align(ap_panel, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

  lv_obj_t *ap_title = lv_label_create(ap_panel);
  lv_label_set_text(ap_title, "WiFi AP");
  lv_obj_set_style_text_color(ap_title, lv_palette_main(LV_PALETTE_YELLOW), 0);
  lv_obj_set_style_text_font(ap_title, &lv_font_montserrat_14, 0);

  ui_label_ap = lv_label_create(ap_panel);
  lv_label_set_recolor(ui_label_ap, true);
  lv_label_set_text(ui_label_ap, "#FF0000 Stop#");
  lv_obj_set_style_text_align(ui_label_ap, LV_TEXT_ALIGN_CENTER, 0);

  ui_label_clients = lv_label_create(ap_panel);
  lv_label_set_text(ui_label_clients, "Clients: 0");
  lv_obj_set_style_text_color(ui_label_clients, lv_palette_main(LV_PALETTE_GREY), 0);

#ifdef ENABLE_TEST_BALL
  /* 노란 사각형 공 — 단순 rect (LV_RADIUS_CIRCLE 제거로 DMA hang 방지) */
  ui_test_rect = lv_obj_create(scr);
  if (ui_test_rect) {
    lv_obj_set_size(ui_test_rect, 25, 25);
    lv_obj_set_style_bg_color(ui_test_rect, lv_palette_main(LV_PALETTE_YELLOW), 0);
    lv_obj_set_style_bg_opa(ui_test_rect, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(ui_test_rect, 0, 0);
    lv_obj_set_style_radius(ui_test_rect, LV_RADIUS_CIRCLE, 0);       // 원형으로 변경
    // CENTER align 제거: set_pos()가 오프셋이 아닌 절대좌표로 동작하도록
    lv_obj_set_pos(ui_test_rect, (320 - 25) / 2, (240 - 25) / 2); // 화면 중앙
    lv_timer_create(move_test_rect_cb, 16, NULL);
  }
#elif defined(ENABLE_GRADIENT_BG)
  // 공은 없지만 그라데이션만 활성화된 경우 타이머 생성
  lv_timer_create(move_test_rect_cb, 16, NULL);
#endif

  /* Color Verification Boxes (R, G, B) - Left Aligned */
  lv_obj_t *red_box = lv_obj_create(scr);
  lv_obj_set_size(red_box, 30, 30);
  lv_obj_set_style_bg_color(red_box, lv_palette_main(LV_PALETTE_RED), 0);
  lv_obj_align(red_box, LV_ALIGN_BOTTOM_LEFT, 10, -10);

  lv_obj_t *green_box = lv_obj_create(scr);
  lv_obj_set_size(green_box, 30, 30);
  lv_obj_set_style_bg_color(green_box, lv_palette_main(LV_PALETTE_GREEN), 0);
  lv_obj_align(green_box, LV_ALIGN_BOTTOM_LEFT, 45, -10);

  lv_obj_t *blue_box = lv_obj_create(scr);
  lv_obj_set_size(blue_box, 30, 30);
  lv_obj_set_style_bg_color(blue_box, lv_palette_main(LV_PALETTE_BLUE), 0);
  lv_obj_align(blue_box, LV_ALIGN_BOTTOM_LEFT, 80, -10);
}

/**
 * @brief Update LCD with current network status (LVGL version)
 */
void updateLCD() {
#if ENABLE_LCD
  if (!lcd_initialized) {
    return;
  }

  // Update Ethernet Status Label
  if (eth_connected) {
    char buf_eth[64];
    snprintf(buf_eth, sizeof(buf_eth), "#00FF00 Link Up#\n\n%s", ETH.localIP().toString().c_str());
    lv_label_set_text(ui_label_eth, buf_eth);
  } else {
    lv_label_set_text(ui_label_eth, "#FF0000 Offline#");
  }

  // Update AP Status Label
  if (ap_started) {
    char buf_ap[64];
    snprintf(buf_ap, sizeof(buf_ap), "#00FF00 Active#\n\n%s", ap_ssid_custom.c_str());
    lv_label_set_text(ui_label_ap, buf_ap);

    char buf_clients[32];
    snprintf(buf_clients, sizeof(buf_clients), "Clients: %d", WiFi.softAPgetStationNum());
    lv_label_set_text(ui_label_clients, buf_clients);
  } else {
    lv_label_set_text(ui_label_ap, "#FF0000 Stop#");
    lv_label_set_text(ui_label_clients, "Clients: 0");
  }
#endif
}

/**
 * @brief Handle Serial Shell Commands
 */
void handleShell() {
  while (Serial.available()) {
    char inChar = (char)Serial.read();

    // ANSI Escape Sequence Parser
    if (ansi_state == ANSI_NONE) {
      if (inChar == 0x1B) { // ESC
        ansi_state = ANSI_ESC;
        continue;
      }
    } else if (ansi_state == ANSI_ESC) {
      if (inChar == '[') {
        ansi_state = ANSI_BRACKET;
      } else {
        ansi_state = ANSI_NONE;
      }
      continue;
    } else if (ansi_state == ANSI_BRACKET) {
      ansi_state = ANSI_NONE;
      if (inChar == 'A') { // UP Arrow
        if (history_count > 0) {
          if (history_index == -1) history_index = history_count - 1;
          else if (history_index > 0) history_index--;
          
          inputString = shell_history[history_index];
          cursor_pos = inputString.length();
          refreshLine();
        }
        continue;
      }
      else if (inChar == 'B') { // DOWN Arrow
        if (history_count > 0 && history_index != -1) {
          history_index++;
          if (history_index >= history_count) {
            history_index = -1;
            inputString = "";
          } else {
            inputString = shell_history[history_index];
          }
          cursor_pos = inputString.length();
          refreshLine();
        }
        continue;
      }
      else if (inChar == 'C') { // RIGHT Arrow
        if (cursor_pos < inputString.length()) {
          cursor_pos++;
          Serial.print("\033[C"); // ANSI Right
        }
        continue;
      }
      else if (inChar == 'D') { // LEFT Arrow
        if (cursor_pos > 0) {
          cursor_pos--;
          Serial.print("\033[D"); // ANSI Left
        }
        continue;
      }
      continue;
    }
    
    // Ctrl+C (Cancel)
    if (inChar == 0x03) {
      if (ping_running) {
        ping_running = false;
        Serial.print("^C\r\nStopping ping.\r\n> ");
      } else if (top_running) {
        top_running = false;
        cpuStats.clear();
        Serial.print("^C\r\nStopping top.\r\n> ");
      } else {
        Serial.print("^C\r\n> ");
      }

