zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
      inputString = "";
      cursor_pos = 0;
      history_index = -1;
      tab_match_index = -1;
      tab_prefix = "";
      continue;
    }

    // Reset Tab Cycling if anything else is pressed
    if (inChar != 0x09) {
      tab_match_index = -1;
      tab_prefix = "";
    }

    // Echo back the character
    if (inChar == '\n' || inChar == '\r') {
      Serial.print("\r\n"); // New line on enter
      if (inputString.length() > 0) {
        // Save to history
        if (history_count == 0 || shell_history[history_count-1] != inputString) {
          if (history_count < MAX_HISTORY) {
            shell_history[history_count++] = inputString;
          } else {
            for (int i = 0; i < MAX_HISTORY - 1; i++) shell_history[i] = shell_history[i+1];
            shell_history[MAX_HISTORY-1] = inputString;
          }
        }
        history_index = -1;
        cursor_pos = 0; // Reset for next command
        stringComplete = true;
      } else {
        Serial.print("> "); // Empty line, just show prompt
        cursor_pos = 0;
      }
    } 
    else if (inChar == 0x09) { // Tab key
      if (inputString.length() > 0) {
        // First tab or cycling?
        if (tab_match_index == -1) {
          tab_prefix = inputString;
          tab_match_index = 0;
        } else {
          tab_match_index++;
        }

        String matches[shell_cmd_count];
        int matchCount = 0;
        for (int i = 0; i < shell_cmd_count; i++) {
          if (String(shell_commands[i]).startsWith(tab_prefix)) {
            matches[matchCount++] = shell_commands[i];
          }
        }

        if (matchCount > 0) {
          if (tab_match_index >= matchCount) tab_match_index = 0;
          
          inputString = matches[tab_match_index];
          cursor_pos = inputString.length();
          refreshLine();
        }
      }
    }
    else if (inChar == 0x08 || inChar == 0x7F) { // Backspace or Delete
      if (cursor_pos > 0) {
        inputString.remove(cursor_pos - 1, 1);
        cursor_pos--;
        refreshLine();
      }
    }
    else {
      // Insert character at cursor_pos
      if (cursor_pos == inputString.length()) {
        inputString += inChar;
        cursor_pos++;
        Serial.print(inChar); // Normal echo
      } else {
        String start = inputString.substring(0, cursor_pos);
        String end = inputString.substring(cursor_pos);
        inputString = start + inChar + end;
        cursor_pos++;
        refreshLine();
      }
    }
  }

  if (stringComplete) {
    inputString.trim();
    // Handled in handleShell loop already

    String cmd = inputString;
    String arg = "";
    int spaceIndex = inputString.indexOf(' ');
    if (spaceIndex != -1) {
      cmd = inputString.substring(0, spaceIndex);
      arg = inputString.substring(spaceIndex + 1);
      arg.trim();
    }

    if (cmd.equalsIgnoreCase("help")) {
      Serial.print("\n\rAvailable Commands:\r\n");
      Serial.print("  help            - Show this help\r\n");
      Serial.print("  status          - Show current system status\r\n");
      Serial.print("  dmesg [lines]   - Show system kernel logs (Ring Buffer)\r\n");
      Serial.print("  loglevel <0-4>  - Set log level (0:NONE, 1:ERR, 2:WARN, 3:INFO, 4:DEBUG)\r\n");
      Serial.print("  monitor <on/off>- Toggle periodic status printing\r\n");
      Serial.print("  restart         - Reboot system\r\n");
      Serial.print("  set_ssid <ssid> - Change WiFi AP SSID\r\n");
      Serial.print("  set_pw <pass>   - Change WiFi AP Password\r\n");
#ifdef ENABLE_ETHERNET
      Serial.print("  stats           - Show interface statistics (Bytes/Packets)\r\n");
      Serial.print("  traffic [on/off]- Show NAT sessions (if on, periodically shows speed)\r\n");
#endif
      Serial.print("  ping <host>     - Ping a host (domain or IP)\r\n");
      Serial.print("  top             - Show real-time CPU usage per core (Press Ctrl+C to stop)\r\n");
      Serial.print("  ps              - Show all tasks: name, state, priority, stack, core\r\n");
      Serial.print("  ifconfig        - Show network interface configurations\r\n");
      Serial.print("  free            - Show detailed SRAM/PSRAM memory map\r\n");
      Serial.print("  arp             - Show connected AP clients (MAC/RSSI)\r\n");
#ifdef ENABLE_ETHERNET
      Serial.print("  dhcp            - Show DHCP server leases (IP/MAC mappings)\r\n");
      Serial.print("  iperf <start|stop>- Start/stop TCP iPerf Server (Port 5001)\r\n");
      Serial.print("  udp_iperf <start|stop>- Start/stop UDP Speed Test (Port 5002)\r\n");
      Serial.print("  toe_iperf <start|stop> [-s | -c ip] - Start/stop W5500 TOE Speed Test\r\n");
#endif
#ifdef ENABLE_AUDIO
      Serial.print("  audio <start|stop|volume 0-100> - Control I2S Sine Wave Output\r\n");
#endif
      Serial.print("\r\n");
    } 
    else if (cmd.equalsIgnoreCase("status")) {
      Serial.print("\n\r--- System Status ---\r\n");
      Serial.printf("Ethernet: %s (IP: %s)\r\n", eth_connected ? "Connected" : "Disconnected", ETH.localIP().toString().c_str());
      Serial.printf("WiFi AP : %s (SSID: %s)\r\n", ap_started ? "Running" : "Stopped", ap_ssid_custom.c_str());
      Serial.printf("Clients : %d\r\n", WiFi.softAPgetStationNum());
      Serial.printf("Log Lev : %d\r\n", (int)current_log_level);
      Serial.printf("Monitor : %s\r\n", monitor_enabled ? "ON" : "OFF");
      Serial.printf("Uptime  : %lu sec\r\n", millis() / 1000);
      Serial.printf("CPU Freq: %u MHz\r\n", getCpuFrequencyMhz());
      Serial.printf("Flash   : %u MB\r\n", ESP.getFlashChipSize() / (1024 * 1024));
      
      // CPU Temperature (Best effort)
      float temp = temperatureRead();
      if (!isnan(temp)) {
        Serial.printf("CPU Temp: %.1f °C\r\n", temp);
      }
      
      Serial.printf("Free RAM: %u KB (Internal)\r\n", ESP.getFreeHeap() / 1024);
      Serial.printf("Min Free: %u KB (Internal Min)\r\n", ESP.getMinFreeHeap() / 1024);
      if (psramFound()) {
        Serial.printf("PSRAM   : %u / %u KB (Free/Total)\r\n", ESP.getFreePsram() / 1024, ESP.getPsramSize() / 1024);
      } else {
        Serial.print("PSRAM   : Not Found\r\n");
      }
      Serial.print("-----------------------------\r\n\r\n");
      
      // Also show the detailed map for completeness
      printMemoryMap();
    }
    else if (cmd.equalsIgnoreCase("ls")) {
      list_files("/fatfs");
    }
    else if (cmd.equalsIgnoreCase("mount")) {
      mount_file_system();
    }
    else if (cmd.equalsIgnoreCase("umount")) {
      unmount_file_system();
    }
    else if (cmd.equalsIgnoreCase("free") || cmd.equalsIgnoreCase("meminfo")) {
      printMemoryMap();
    }
    else if (cmd.equalsIgnoreCase("dmesg")) {
      Serial.print("\n\r--- System Logs (dmesg) ---\r\n");
      
