zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
        socket_bridge_cfg_t cfg = {0};
        cfg.listen_port = listen_port;
        
        IPAddress target_ip_addr;
        if (target_ip_addr.fromString(target_ip)) {
            for(int i=0; i<4; i++) cfg.target_ip[i] = target_ip_addr[i];
        } else {
            // Default if parsing fails
            cfg.target_ip[0] = 192; cfg.target_ip[1] = 168; cfg.target_ip[2] = 0; cfg.target_ip[3] = 100;
        }
        
        cfg.target_port = target_port;
        cfg.local_ip = ETH.localIP();
        cfg.gateway = ETH.gatewayIP();
        cfg.subnet = ETH.subnetMask();
        esp_read_mac(cfg.mac_addr, ESP_MAC_ETH);
        cfg.is_udp = false;

        Serial.printf("[Bridge] Connecting WiFi:%d <-> Ethernet:%s:%d\n", listen_port, cfg.target_ip, cfg.target_port);
        ETH.end(); 

        if(socket_bridge_start(&cfg)) {
            Serial.println("[Bridge] Started.");
        } else {
            Serial.println("[Bridge] Failed.");
            ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN, SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, W5500_SPI_CLOCK_MHZ);
        }
      } else if (arg.equalsIgnoreCase("stop")) {
        socket_bridge_stop();
        Serial.println("[Bridge] Stopped.");
        delay(500);
        ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN, SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, W5500_SPI_CLOCK_MHZ);
      } else {
        Serial.println("Usage: bridge start <listen_port> <target_ip> <target_port>");
        Serial.println("       bridge stop");
      }
    }
#endif
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("udp_iperf")) {
      if (arg.equalsIgnoreCase("start")) {
        if (udp_iperf_running) {
           Serial.println("UDP iPerf server is already running on port 5002.");
        } else {
           if (udp_iperf_server.listen(5002)) {
               udp_iperf_server.onPacket(onUDPPacket);
               udp_iperf_running = true;
               udp_iperf_bytes = 0;
               udp_iperf_last_print = millis();
               Serial.println("UDP Test server started on Port 5002.");
               Serial.println("Connect with: iperf -c <IP> -u -p 5002 -b 20M -i 1 -t 10");
           } else {
               Serial.println("Failed to start UDP Test server.");
           }
        }
      } else if (arg.equalsIgnoreCase("stop")) {
        if (udp_iperf_running) {
           udp_iperf_server.close();
           udp_iperf_running = false;
           Serial.println("UDP Test server stopped.");
        } else {
           Serial.println("UDP Test server is not running.");
        }
      } else {
        Serial.println("Usage: udp_iperf <start|stop>");
      }
    }
#endif
    else if (cmd.equalsIgnoreCase("top")) {
      if (top_running) {
        top_running = false;
        Serial.println("[System] Monitor stopped.");
      } else {
        top_running = true;
        last_top_time = 0; // trigger immediate first print
        Serial.println("[System] Real-time Monitor Started. Press Ctrl+C to exit.");
      }
    }
    else if (cmd.equalsIgnoreCase("ps")) {
      // One-shot snapshot: no background polling, zero ongoing overhead
      UBaseType_t taskCount = uxTaskGetNumberOfTasks();
      TaskStatus_t *taskList = (TaskStatus_t *)malloc(taskCount * sizeof(TaskStatus_t));
      if (taskList) {
        UBaseType_t actual = uxTaskGetSystemState(taskList, taskCount, NULL);
        Serial.print("\r\n--- Task Snapshot ---\r\n");
        Serial.printf(" %-3s %-16s %-6s %3s  %-10s  %s\r\n",
                      "#", "NAME", "STATE", "PRI", "STACK_FREE", "CORE");
        Serial.print("----------------------------------------------\r\n");
        for (UBaseType_t i = 0; i < actual; i++) {
          const char *state;
          switch (taskList[i].eCurrentState) {
            case eRunning:   state = "Run  "; break;
            case eReady:     state = "Ready"; break;
            case eBlocked:   state = "Block"; break;
            case eSuspended: state = "Susp "; break;
            case eDeleted:   state = "Del  "; break;
            default:         state = "?    "; break;
          }
          char coreStr[5];
          BaseType_t coreId = taskList[i].xCoreID;
          if ((uint32_t)coreId == (uint32_t)tskNO_AFFINITY) {
            snprintf(coreStr, sizeof(coreStr), "Any");
          } else {
            snprintf(coreStr, sizeof(coreStr), "%d", (int)coreId);
          }
          Serial.printf(" %-3u %-16s %s  %3u  %-10u  %s\r\n",
            (unsigned)taskList[i].xTaskNumber,
            taskList[i].pcTaskName,
            state,
            (unsigned)taskList[i].uxCurrentPriority,
            (unsigned)taskList[i].usStackHighWaterMark,
            coreStr);
        }
        Serial.printf("----------------------------------------------\r\n");
        Serial.printf("Total: %u tasks\r\n\r\n", (unsigned)actual);
        free(taskList);
      } else {
        Serial.println("[ERROR] ps: malloc failed.\r\n");
      }
    }
#ifdef ENABLE_AUDIO
    else if (cmd.equalsIgnoreCase("audio")) {
      if (arg.equalsIgnoreCase("start")) {
        audio_output_start();
      } else if (arg.equalsIgnoreCase("stop")) {
        audio_output_stop();
      } else if (arg.startsWith("volume")) {
        int space_idx = arg.indexOf(' ');
        if (space_idx != -1) {
            int vol = arg.substring(space_idx + 1).toInt();
            audio_output_set_volume(vol);
        } else {
            Serial.println("Usage: audio volume <0-100>");
        }
      } else if (arg.startsWith("play")) {
        int space_idx = arg.indexOf(' ');
        if (space_idx != -1) {
            String filename = arg.substring(space_idx + 1);
            audio_player_play(filename.c_str());
            Serial.printf("Playing: %s\n", filename.c_str());
        } else {
            Serial.println("Usage: audio play <filename>");
        }
      } else if (arg.equalsIgnoreCase("sine")) {
        audio_output_play_sine();
        Serial.println("Playing test sine wave...");
      } else {
        Serial.println("Usage: audio <start|stop|volume|play|sine>");
      }
    }
#endif

    else {
      Serial.printf("Unknown command: %s. Type 'help' for list.\r\n", cmd.c_str());
    }

