zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
    inputString = "";
    stringComplete = false;
    Serial.print("> "); // Prompt for next command
  }
}

/**
 * @brief WiFi and Ethernet event handler
 *
 * Handles connection events for both Ethernet and WiFi AP interfaces.
 * When Ethernet gets an IP, starts the WiFi AP and enables NAPT for packet
 * forwarding.
 */
void NetworkEvent(arduino_event_id_t event) {
  switch (event) {
#ifdef ENABLE_ETHERNET
  case ARDUINO_EVENT_ETH_START:
    logMsg(LOG_INFO, "ETH Started");
    ETH.setHostname("tas-bridge");
    installHooks(); // Try installing hooks on start
    break;

  case ARDUINO_EVENT_ETH_CONNECTED:
    logMsg(LOG_INFO, "ETH Connected");
    installHooks(); // Re-verify hooks on connection
    break;

  case ARDUINO_EVENT_ETH_GOT_IP:
    logMsg(LOG_INFO, "ETH MAC: %s, IPv4: %s, %s, %d Mbps", 
           ETH.macAddress().c_str(), ETH.localIP().toString().c_str(),
           ETH.fullDuplex() ? "FULL_DUPLEX" : "HALF_DUPLEX", ETH.linkSpeed());
    eth_connected = true;

    // [Optimization] WiFi AP 장치들이 이더넷을 통해 인터넷 및 외부 장치(라즈베리파이 등)와 통신 가능하도록 NAPT 활성화
    if (WiFi.AP.enableNAPT(true)) {
      logMsg(LOG_INFO, "NAPT enabled - Internet sharing active");
    } else {
      logMsg(LOG_ERROR, "NAPT enable failed!");
    }
    break;

  case ARDUINO_EVENT_ETH_DISCONNECTED:
    logMsg(LOG_WARN, "ETH Disconnected");
    eth_connected = false;
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    WiFi.AP.enableNAPT(false);
#endif
    break;

  case ARDUINO_EVENT_ETH_STOP:
    logMsg(LOG_INFO, "ETH Stopped");
    eth_connected = false;
    break;
#endif

  case ARDUINO_EVENT_WIFI_AP_START:
    logMsg(LOG_INFO, "WiFi AP Started (SSID: %s, IP: %s)", ap_ssid_custom.c_str(), WiFi.softAPIP().toString().c_str());
    ap_started = true;
    break;

  case ARDUINO_EVENT_WIFI_AP_STOP:
    logMsg(LOG_INFO, "WiFi AP Stopped");
    ap_started = false;
    break;

  case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
    logMsg(LOG_INFO, "WiFi AP: Station connected");
    break;

  case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
    logMsg(LOG_INFO, "WiFi AP: Station disconnected");
    break;

  default:
    break;
  }
  // Queue LCD update on any major network event to be handled safely in the main loop
  _pending_ui_update = true;
}

void printMemoryMap() {
    multi_heap_info_t info;
    heap_caps_get_info(&info, MALLOC_CAP_INTERNAL);
    size_t total_heap = heap_caps_get_total_size(MALLOC_CAP_INTERNAL);
    size_t free_heap = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
    size_t min_free = heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL);
    
    Serial.println("\n========= SRAM Memory Map (Total 512.0 KB) =========");
    Serial.printf("[1. Static/System RAM] : %.1f KB (Fixed)\n", (512 * 1024 - (double)total_heap) / 1024.0);
    Serial.printf("[2. Internal Heap Pool]: %.1f KB (Dynamic)\n", total_heap / 1024.0);
    Serial.printf("    ├── Used Heap Space: %.1f KB\n", (total_heap - free_heap) / 1024.0);
    Serial.printf("    └── Free Heap Space: %.1f KB (Available)\n", free_heap / 1024.0);
    
    Serial.printf("\n[HEAP Details]\n");
    Serial.printf("    ├── Min. Ever Free : %.1f KB\n", min_free / 1024.0);
    Serial.printf("    └── Max. Block Size: %.1f KB\n", info.largest_free_block / 1024.0);

    if (psramFound()) {
        Serial.println("\n--- PSRAM Status ---");
        Serial.printf("[PSRAM] Total: %.1f KB\n", ESP.getPsramSize() / 1024.0);
        Serial.printf("[PSRAM] Free : %.1f KB\n", ESP.getFreePsram() / 1024.0);
        Serial.printf("[PSRAM] Used : %.1f KB\n", (ESP.getPsramSize() - ESP.getFreePsram()) / 1024.0);
    }
    
    Serial.println("\n--- Task Stack High Water Marks ---");
    // Show stats for the calling task
    size_t free_stack = uxTaskGetStackHighWaterMark(NULL);
    Serial.printf("[TASK] Current Task Stack: %.1f KB Free space\n", free_stack / 1024.0);
    Serial.println("===================================================\n");
}

void setup() {
#ifdef ENABLE_TASK_PRIORITY_TUNING
    // UI/App 태스크 우선순위 조정 (이벤트 태스크 19보다 낮은 18로 설정하여 네트워크 안정성 확보)
    vTaskPrioritySet(NULL, 18);
#endif

    Serial.begin(115200);
#ifdef ENABLE_FILE_PLAYER
    init_file_system();
#endif
#ifdef ENABLE_USB_MSC
    init_usb_msc();
#endif

    audio_player_init();
    delay(500);

    printMemoryMap();
  Serial.begin(115200);
  delay(1000); // Wait for Serial to stabilize

  esp_reset_reason_t reason = esp_reset_reason();
  Serial.printf("\n\n[System] Reset Reason: %d\n", reason);

  Serial.println("===== tas Bridge Example =====");
  Serial.println("Ethernet to WiFi AP Bridge using NAPT");
  Serial.println("=====================================\n");

  // 현재 적용된 네트워크 최적화 상태 출력
#ifdef CONFIG_LWIP_TCP_WND_DEFAULT
  Serial.printf("[Config] TCP Window Size: %d Bytes\n", CONFIG_LWIP_TCP_WND_DEFAULT);
#else
  Serial.println("[Config] TCP Window Size: Default (Unknown)");
#endif

#ifdef CONFIG_LWIP_IRAM_OPTIMIZATION
  Serial.println("[Config] lwIP IRAM Optimization: ENABLED");
#else
  Serial.println("[Config] lwIP IRAM Optimization: DISABLED");
#endif

#ifdef CONFIG_ESP32_WIFI_IRAM_OPT
  Serial.println("[Config] WiFi IRAM Optimization: ENABLED");
#else
  Serial.println("[Config] WiFi IRAM Optimization: DISABLED");
#endif
  
  Serial.print("> "); // Initial prompt

  // Step 0: Load saved settings from NVS
  preferences.begin("wifi-config", false); // Open in read-write mode to save if not exists
  if (!preferences.isKey("ssid")) {
    preferences.putString("ssid", ap_ssid_custom);
    preferences.putString("password", ap_pw_custom);
  } else {
    ap_ssid_custom = preferences.getString("ssid", AP_SSID_BASE);
    ap_pw_custom = preferences.getString("password", AP_PASSWORD_BASE);
  }
  preferences.end();
  logMsg(LOG_INFO, "Loaded settings: SSID='%s'", ap_ssid_custom.c_str());

  // CPU Idle Hook 캘리브레이션 (WiFi 시작 전에 실행하여 정확한 100% idle 기준 확보)
  cpuStats.begin();

  // Step 1: Start WiFi AP immediately (Always-On Priority)
  logMsg(LOG_INFO, "Step 1: Starting WiFi AP (softAP)... %s", 
    WiFi.softAP(ap_ssid_custom.c_str(), ap_pw_custom.c_str(), AP_CHANNEL, 0, AP_MAX_CONN) ? "Success" : "FAILED");

