zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
    // WiFi 전력 절약 모드 해제 (지연 시간 최적화)
    esp_wifi_set_ps(WIFI_PS_NONE);

#ifdef ENABLE_TASK_PRIORITY_TUNING
    // [최적화] TCP/IP 스택(tiT) 태스크 우선순위 강제 상향 (기본 18 -> 24)
    TaskHandle_t tiT_handle = xTaskGetHandle("tiT");
    if (tiT_handle != NULL) {
        vTaskPrioritySet(tiT_handle, 24);
        logMsg(LOG_INFO, "Priority of 'tiT' task set to 24 successfully.");
    } else {
        logMsg(LOG_WARN, "Could not find 'tiT' task handle.");
    }
#endif

    logMsg(LOG_INFO, "WiFi AP Setup: SSID=%s, CH=%d, MAX_CONN=%d", 
         ap_ssid_custom.c_str(), AP_CHANNEL, AP_MAX_CONN);

  esp_err_t err = esp_wifi_set_bandwidth(WIFI_IF_AP, WIFI_BW_HT40);
  logMsg(LOG_INFO, "Step 2: Setting WiFi Bandwidth to HT40... %s", (err == ESP_OK) ? "Success" : "FAILED");

  logMsg(LOG_INFO, "Step 3: Checking AP Status... SSID: %s, IP: %s", 
         ap_ssid_custom.c_str(), WiFi.softAPIP().toString().c_str());
  ap_started = true;

  // Step 4: Setting up WiFi events
  Serial.print("Step 4: Registering Network Events... ");
  WiFi.onEvent(NetworkEvent);
  Serial.println("Done.");

  Serial.println("\n[Note] WiFi AP is running.");
  Serial.println("       Internet access will be available after Ethernet connection.\n");

  // Step 5: Initialize LCD (Dynamically detected)
#if ENABLE_LCD
    // Dynamic Allocation to prevent static initialization order issues
#ifdef USE_LOVYANGFX
    tft = new LGFX();
#else
    tft = new TFT_eSPI();
    Serial.printf("  [DIAG] TFT_eSPI Instance: %p\n", tft);
#endif

  // 진단을 위해 SPI를 미리 열면 TFT_eSPI 라이브러리와 충돌하므로 주석 처리 (순정 아두이노 방식 유지)
  // lcd_detected = detectLCD();
  lcd_detected = true;
  
  if (lcd_detected) {
    Serial.println("\r\n--- LCD Control Pin Configuration ---");
#ifdef USE_LOVYANGFX
    #ifdef LGFX_DC
    Serial.printf("  LCD_DC   : GPIO %d\n", LGFX_DC);
    #endif
    #ifdef LGFX_CS
    Serial.printf("  LCD_CS   : GPIO %d\n", LGFX_CS);
    #endif
    #ifdef LGFX_RST
    Serial.printf("  LCD_RST  : GPIO %d\n", LGFX_RST);
    #endif
#else
    #if defined(TFT_WR)
    Serial.printf("  TFT_WR  : GPIO %d\n", TFT_WR);
    #endif
    Serial.printf("  TFT_DC  : GPIO %d\n", TFT_DC);
    #if defined(TFT_CS) && TFT_CS >= 0
    Serial.printf("  TFT_CS  : GPIO %d\n", TFT_CS);
    #else
    Serial.println("  TFT_CS  : DISABLED (-1)");
    #endif
    #if defined(TFT_RST) && TFT_RST >= 0
    Serial.printf("  TFT_RST : GPIO %d\n", TFT_RST);
    #endif
#endif
    Serial.println("-------------------------------------\n");

    // Backlight is hardware-wired to VCC, no software control needed.
    Serial.println("Backlight: Hardware VCC (Skip Init).");

#ifdef USE_LOVYANGFX
    #ifdef LGFX_RST
    Serial.printf("Step 5: Resetting LCD (LGFX_RST GPIO %d)... ", LGFX_RST);
    pinMode(LGFX_RST, OUTPUT);
    digitalWrite(LGFX_RST, LOW);
    delay(100);
    digitalWrite(LGFX_RST, HIGH);
    delay(150);
    Serial.println("Done.");
    #endif
#else
    #if defined(TFT_RST) && TFT_RST >= 0
    Serial.printf("Step 5: Resetting LCD (TFT_RST GPIO %d)... ", TFT_RST);
    pinMode(TFT_RST, OUTPUT);
    digitalWrite(TFT_RST, LOW);
    delay(100);
    digitalWrite(TFT_RST, HIGH);
    delay(150);
    Serial.println("Done.");
    #endif
#endif

    tft->init();
    tft->setSwapBytes(false); // LVGL handles swapping now (Efficiency)
    tft->setRotation(0); // Try Rotation 0 for Native Landscape

#ifdef USE_LOVYANGFX
    Serial.printf("  [DIAG] LCD Panel (LovyanGFX Mode)\n");
#else
    // TFT_eSPI: MISO 미연결 시 hang 방지를 위해 읽기 진단 비활성화
    Serial.println("  [DIAG] LCD Panel ID: Skip (Force Mode)");
#endif

#ifdef ENABLE_TE_SYNC
    // ... (TE_SYNC 블록)
#else
    // Fast Mode: TE 미사용 및 패널 하드웨어 기본값(보통 60Hz) 그대로 작동하도록 방치
    Serial.println("ST7789 TE Sync Disabled (Fast Mode - Default Hardware Refresh Rate)");
    
    // 3. Initialize LCD using LovyanGFX (LGFX)
    // LovyanGFX handles pin mapping and DMA setup automatically for ESP32-S3
    // Note: tft->init() was already called above at line 2176.
#endif

    /* Initialize LVGL and Allocate DMA Buffers in Internal SRAM */
    lv_init();
    
    // Landscape 모드: hor_res = LCD_HEIGHT = 320 → 행 너비 = 320
    // 64 lines: 320*64*2 = 40KB per buffer (DMA 캐시 효율 최적)
    size_t lines = 64;
    size_t buf_size = LCD_HEIGHT * lines * sizeof(lv_color_t); // ← LCD_HEIGHT(320) 사용
    
    buf1 = (lv_color_t *)heap_caps_malloc(buf_size, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    buf2 = (lv_color_t *)heap_caps_malloc(buf_size, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    
    if (buf1 == NULL || buf2 == NULL) {
        Serial.println("Failed to allocate DMA buffers! Falling back to SRAM Single...");
        if(buf1) free(buf1);
        static lv_color_t sram_single[LCD_HEIGHT * 20]; // ← LCD_HEIGHT(320) 사용
        lv_disp_draw_buf_init(&draw_buf, sram_single, NULL, LCD_HEIGHT * 20);
    } else {
        Serial.printf("DMA Double Buffers allocated: 2 x %u bytes\n", buf_size);
        lv_disp_draw_buf_init(&draw_buf, buf1, buf2, LCD_HEIGHT * lines); // ← LCD_HEIGHT(320) 사용
    }


    /* Initialize the display driver for LVGL */
    static lv_disp_drv_t disp_drv;
    lv_disp_drv_init(&disp_drv);
    disp_drv.hor_res = LCD_HEIGHT; // Landscape
    disp_drv.ver_res = LCD_WIDTH;  // Landscape
    disp_drv.flush_cb = my_disp_flush;
    disp_drv.monitor_cb = my_monitor_cb; // 추가: 렌더링 성능 모니터링 연결
    disp_drv.draw_buf = &draw_buf; // CRITICAL: This was missing!
    
    // 부분 업데이트 모드로 복구하여 프레임레이트 복구 및 노이즈 방지
#ifdef ENABLE_FULL_REFRESH
    disp_drv.full_refresh = 1; 
#else
    disp_drv.full_refresh = 0; 
#endif

    lv_disp_t * disp_obj = lv_disp_drv_register(&disp_drv);
    
    /* Initialize and Register Touchpad */
#ifdef ENABLE_TOUCH
#ifdef LCD_TYPE_ILI9341
    //tp.begin();
    //tp.setRotation(1); // Landscape for XPT2046
#elif defined(TOUCH_SDA) && defined(TOUCH_SCL)
    //tp.begin();
    //tp.setRotation(ROTATION_RIGHT);
#endif

    static lv_indev_drv_t indev_drv;
    lv_indev_drv_init(&indev_drv);
    indev_drv.type = LV_INDEV_TYPE_POINTER;
    indev_drv.read_cb = my_touchpad_read;
    lv_indev_drv_register(&indev_drv);

