zenes/esp32s3-TAS/esp-idf-examples/tas/main/main.cpp
    /* Create a touch indicator on System Layer (Always on top) */
    touch_cursor = lv_obj_create(lv_layer_sys());
    lv_obj_set_size(touch_cursor, 10, 10);
    lv_obj_set_style_bg_color(touch_cursor, lv_palette_main(LV_PALETTE_RED), 0);
    lv_obj_set_style_radius(touch_cursor, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_border_width(touch_cursor, 0, 0);
    lv_obj_add_flag(touch_cursor, LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_style_bg_opa(touch_cursor, LV_OPA_70, 0);

    // Horizontal crosshair
    touch_line_h = lv_obj_create(lv_layer_sys());
    lv_obj_set_size(touch_line_h, LCD_HEIGHT, 2); // Thicker (2px)
    lv_obj_set_style_bg_color(touch_line_h, lv_palette_main(LV_PALETTE_LIME), 0);
    lv_obj_add_flag(touch_line_h, LV_OBJ_FLAG_HIDDEN);

    // Vertical crosshair
    touch_line_v = lv_obj_create(lv_layer_sys());
    lv_obj_set_size(touch_line_v, 2, LCD_WIDTH); // Thicker (2px)
    lv_obj_set_style_bg_color(touch_line_v, lv_palette_main(LV_PALETTE_LIME), 0);
    lv_obj_add_flag(touch_line_v, LV_OBJ_FLAG_HIDDEN);

    // Coordinate label
    touch_label = lv_label_create(lv_layer_sys());
    lv_obj_set_style_text_color(touch_label, lv_palette_main(LV_PALETTE_LIME), 0);
    lv_obj_set_style_bg_color(touch_label, lv_palette_main(LV_PALETTE_GREY), 0);
    lv_obj_set_style_bg_opa(touch_label, LV_OPA_50, 0);
    lv_obj_add_flag(touch_label, LV_OBJ_FLAG_HIDDEN);
#endif

#ifdef ENABLE_TE_SYNC
    // Set refresh period to 16ms for 60 FPS (하드웨어 60Hz와 동기화)
    lv_timer_t * refr_timer = _lv_disp_get_refr_timer(disp_obj);
    if (refr_timer) lv_timer_set_period(refr_timer, LV_DISP_DEF_REFR_PERIOD);
#else
    // Set refresh period to 16ms for 60 FPS (최대 성능)
    lv_timer_t * refr_timer = _lv_disp_get_refr_timer(disp_obj);
    if (refr_timer) lv_timer_set_period(refr_timer, LV_DISP_DEF_REFR_PERIOD);
#endif

    lcd_initialized = true; 
    Serial.println("Done.");

    // (cpuStats.begin()은 WiFi 시작 전에 이미 호출됨)

    logMsg(LOG_INFO, "Step 7: LVGL UI creation... Done.");
    initLVGLUI();
    updateLCD();

    Serial.println("Done.");
  } else {
    Serial.println("Step 5-7: LCD Hardware not found. Skipping.");
  }
#else
  Serial.println("Step 5-7: LCD Feature Disabled.");
#endif

  // Step 8: Initialize Ethernet
#ifdef ENABLE_ETHERNET
  logMsg(LOG_INFO, "Step 8: Initializing Ethernet...");

#if CONFIG_IDF_TARGET_ESP32
  ETH.begin(ETH_TYPE, ETH_ADDR, ETH_MDC_PIN, ETH_MDIO_PIN, ETH_RESET_PIN, ETH_CLK_MODE);
#else
  ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN,
            SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, W5500_SPI_CLOCK_MHZ);
#endif

#if USE_STATIC_IP
  ETH.config(local_ip, gateway, subnet, dns1, dns2);
#endif

  logMsg(LOG_INFO, "Ethernet initialization command sent");
  
  // Final Step: Install Hooks
  installHooks(); 
#else
  logMsg(LOG_WARN, "Step 8: Ethernet Feature Disabled (#define ENABLE_ETHERNET).");
#endif

  Serial.println("Waiting for Ethernet connection to enable internet sharing...");
  logMsg(LOG_INFO, "System ready. Type 'help' for commands.");
}

void loop() {
  // Print status every 5 seconds (Changed from 30 for debugging)
  static unsigned long lastStatusPrint = 0;
  unsigned long currentMillis = millis();

  if (currentMillis - lastStatusPrint >= 5000) {
    lastStatusPrint = currentMillis;

    if (monitor_enabled) {
      logMsg(LOG_INFO, "----- Status -----");
#ifdef ENABLE_ETHERNET
      logMsg(LOG_INFO, "Ethernet: %s", eth_connected ? "Connected" : "Disconnected");
      if (eth_connected) {
        logMsg(LOG_INFO, "  IP: %s", ETH.localIP().toString().c_str());
      }
#endif
      logMsg(LOG_INFO, "WiFi AP : %s", ap_started ? "Running" : "Stopped");
      if (ap_started) {
        logMsg(LOG_INFO, "  Clients: %d", WiFi.softAPgetStationNum());
      }
      logMsg(LOG_INFO, "------------------\r\n");
    }

#ifdef ENABLE_ETHERNET
    if (monitor_traffic) {
        unsigned long now = millis();
        if (now - last_speed_check >= 2000) {
          last_speed_check = now;
          Serial.printf("[Monitor] ETH RX: %s, TX: %s | AP RX: %s, TX: %s\r\n", 
                        formatBytes(eth_stats.rx_bytes).c_str(), formatBytes(eth_stats.tx_bytes).c_str(), 
                        formatBytes(ap_stats.rx_bytes).c_str(), formatBytes(ap_stats.tx_bytes).c_str());
        }
    }
#endif

    // Update LCD periodically
    updateLCD();
  }

  // Handle Serial Shell
  handleShell();

  // Handle UDP iPerf Reporting
#ifdef ENABLE_ETHERNET
  if (udp_iperf_running) {
    uint32_t now = millis();
    if (now - udp_iperf_last_print >= 1000) {
      // Calculate Mbps and MB/s
      float mbps = (udp_iperf_bytes * 8.0) / 1000000.0;
      float mb_s = udp_iperf_bytes / (1024.0 * 1024.0);
      
      Serial.printf("\r\n[UDP iPerf] %.2f MB/s  |  %.2f Mbps  (Received: %u Bytes)\r\n> ", mb_s, mbps, (unsigned int)udp_iperf_bytes);
      refreshLine();
      udp_iperf_bytes = 0; // Reset for next second
      udp_iperf_last_print = now;
    }
  }
#endif

  // Infinite Ping
  if (ping_running) {
    if (currentMillis - last_ping_time >= 1000) {
      last_ping_time = currentMillis;
      //bool success = Ping.ping(ping_target.c_str(), 1);
      //if (success) {
      //  Serial.printf("Reply from %s: time=%.2fms\r\n", ping_target.c_str(), 0.0);
      //} else {
      //  Serial.printf("Request timeout for %s\r\n", ping_target.c_str());
      //}
    }
  }

  // Real-time Top Monitoring (Non-blocking - runs inside main loop)
  if (top_running) {
    // Check for Ctrl+C to stop
    if (Serial.available()) {
      char c = Serial.peek();
      if (c == 0x03) { // Ctrl+C
        Serial.read(); // consume it
        top_running = false;
        Serial.println("\r\n[System] Monitor stopped.");
        Serial.print("> ");
      }
    }
    
    if (top_running && (currentMillis - last_top_time >= 1000)) {
      last_top_time = currentMillis;
      
      // ANSI: Clear Screen and Home Cursor
      Serial.print("\033[2J\033[H");
      Serial.println("======================================================");
      Serial.printf(" ESP32-S3 SYSTEM MONITOR | Uptime: %lu s\n", millis() / 1000);
      Serial.println("------------------------------------------------------");
      
      // CPU Load
      cpuStats.update();
      Serial.printf(" Core 0 Load (Net/Sys): %5.1f %%\n", cpuStats.getLoad(0));
      Serial.printf(" Core 1 Load (UI/App) : %5.1f %%\n", cpuStats.getLoad(1));
      Serial.println("------------------------------------------------------");
      
      // Frame Timing Analysis (Summation)
      uint32_t current_fps = (fps_val > 0) ? fps_val : 60;
      uint32_t total_cycle_us = 1000000 / current_fps;
      
      // 조각 개수 계산 (예: 240 / 64 = 3.75 -> 4조각)
      uint32_t num_chunks = (240 + 64 - 1) / 64; 
      uint32_t avg_chunk_flush_us = last_flush_time_us / num_chunks;
      uint32_t first_chunk_render_us = last_pure_render_time_us / num_chunks;
      uint32_t active_time_us = first_chunk_render_us + last_flush_time_us;
      int32_t idle_us = (int32_t)total_cycle_us - (int32_t)active_time_us;
      if (idle_us < 0) idle_us = 0;

      Serial.printf(" [Frame Time Analysis]\n");
      Serial.printf("   Total Cycle  : %5.2f ms (%u FPS) | Active: %5.2f ms | Idle: %5.2f ms\n", 
                    (float)total_cycle_us / 1000.0f, current_fps, (float)active_time_us / 1000.0f, (float)idle_us / 1000.0f);
      Serial.printf("   \n");
      Serial.printf("   ├─ Pure Render: %5.2f ms  [CPU]\n", (float)last_pure_render_time_us / 1000.0f);
      Serial.printf("   ├─ Pure Flush : %5.2f ms  [BUS] (%u chunks, %u ms total)\n", 
                    (float)avg_chunk_flush_us / 1000.0f, num_chunks, last_flush_time_us / 1000);
      Serial.println("------------------------------------------------------");
      
      // Memory Info
      Serial.printf(" Free Heap : %7u KB\n", ESP.getFreeHeap() / 1024);
      if (psramFound()) {
          Serial.printf(" Free PSRAM: %7u KB / %u KB\n", ESP.getFreePsram() / 1024, ESP.getPsramSize() / 1024);
      }
      Serial.printf(" Task Count: %d\n", (int)uxTaskGetNumberOfTasks());
      Serial.printf(" CPU Temp  : %.1f C\n", (float)temperatureRead());
      Serial.println("======================================================");
      Serial.println(" [Press Ctrl+C to stop]");
    }
  }

  // Update LVGL tick and timer handler
  static uint32_t last_tick = 0;
  uint32_t now_tick = millis();
  lv_tick_inc(now_tick - last_tick);
  last_tick = now_tick;

  // Update LVGL timer handler
  refresh_trigger_us = esp_timer_get_time();
  lv_timer_handler();

  // Update FPS Label every 1 second independently
  static uint32_t last_fps_millis = 0;
  static uint32_t last_frame_cnt = 0;
  if (millis() - last_fps_millis >= 1000) {
    if (lcd_initialized && ui_label_fps) {
        // 실제 flush 횟수 기반 정확한 FPS 계산
        uint32_t current_frame_cnt = frame_cnt;
        fps_val = current_frame_cnt - last_frame_cnt;
        last_frame_cnt = current_frame_cnt;

        char buf_fps[32];
        if (last_flush_time_us < 1000) {
          snprintf(buf_fps, sizeof(buf_fps), "FPS:%u F:%uus R:%uus", fps_val, last_flush_time_us, last_pure_render_time_us);
        } else {
          snprintf(buf_fps, sizeof(buf_fps), "FPS:%u F:%.1fms R:%.1fms", fps_val, (float)last_flush_time_us / 1000.0f, (float)last_pure_render_time_us / 1000.0f);
        }
        lv_label_set_text(ui_label_fps, buf_fps);
    }

    // CPU 시스템 부하 갱신 및 UI 업데이트 (Idle Hook + 10s Warm-up)
    cpuStats.update();
    if (lcd_initialized && ui_label_cpu0 && ui_label_cpu1) {
        char buf_cpu[24];
        if (!cpuStats.isReady()) {
            // warm-up 중: 깜빡이는 점으로 진행 중임을 표시
            static uint8_t dot_cycle = 0;
            if (++dot_cycle > 3) dot_cycle = 0;
            const char* dots[] = {"C0: .", "C0: ..", "C0: ...", "C0:    "};
            lv_label_set_text(ui_label_cpu0, dots[dot_cycle]);
            lv_label_set_text(ui_label_cpu1, "C1: cal");
        } else {
            snprintf(buf_cpu, sizeof(buf_cpu), "C0:%5.1f%%", cpuStats.getLoad(0));
            lv_label_set_text(ui_label_cpu0, buf_cpu);
            snprintf(buf_cpu, sizeof(buf_cpu), "C1:%5.1f%%", cpuStats.getLoad(1));
            lv_label_set_text(ui_label_cpu1, buf_cpu);
        }
    }
    
#ifdef ENABLE_TE_SYNC
    if (lcd_initialized && ui_label_te) {
        int64_t delta_us = te_delta_us;
        if (delta_us > 0) {
            float te_ms = delta_us / 1000.0f;
            float te_hz = 1000000.0f / delta_us;
            char buf_te[32];
            snprintf(buf_te, sizeof(buf_te), "TE: %.1fms(%.1fHz)", te_ms, te_hz);
            lv_label_set_text(ui_label_te, buf_te);
        }
    }
#endif
    last_fps_millis = millis();
  }

  // Minimal delay for system stability while maximizing loop throughput
  yield(); 
}


extern "C" void app_main() {
    initArduino();
    setup();
    while(1) {
        loop();
        vTaskDelay(pdMS_TO_TICKS(1));
    }
}
